"""Завдання 8.4"""

import random

# def make_sudoku(size):
#     pass

size = 3

# трьохмірна матриця
x = [
     [1, 2, 3],
     [4, 5, 6],
     [7, 8, 9]
]

y = [
    [],
    [],
    []
]


# двохмірна матриця

x1 = [
    [1, 2, 3, 4, 3, 6, 7, 8, 9],
    [4, 5, 6, 2, 8, 9, 3, 5, 4],
    [7, 8, 9, 1, 6, 2, 0, 6, 7],
    [1, 2, 3, 4, 3, 6, 7, 8, 9],
    [4, 5, 6, 2, 8, 9, 3, 5, 4],
    [7, 8, 9, 1, 6, 2, 0, 6, 7],
    [1, 2, 3, 4, 3, 6, 7, 8, 9],
    [4, 5, 6, 2, 8, 9, 3, 5, 4],
    [7, 8, 9, 1, 6, 2, 0, 6, 7]

]
k = 3

n = [num for num in range(1, 10)]
print(n)

m = []
for i in range(k):
    for j in range(k):
        m[i][j] = random.randint(1, 10)  # оце преробити з рандомом
        print(m[i][j])


