import math

num_of_pencils = int(input("    Уявіть, що у вас є певна кількість різнокольорових олівців. \n"
      "Вони розкладені на столі у рядок. \n"
      "Скількома способами можна переставити олівці? \n"
      "Щоб дізнатись, введіть кількість олівців: "))

print(math.factorial(num_of_pencils))
print("\n")


num_of_places = int(input("    А тепер уявімо, що у вас є кольоровий пароль. \n"
      "У ньому кожен елемент відповідає певному кольору, всі елементи розміщені у рядок. \n"
      "Кольори можуть повторюватись, і взагалі розміщуватись у будь-якому порядку. \n"
      "Щоб дізнатись, скільки кольорових паролів можна створити, введіть довжину пароля і кількість кольорів. \n "
      "Довжина пароля: "))
num_of_elements = int(input("Кількість кольорів: "))

print(num_of_elements ** num_of_places)
print("\n")


num_of_friends = int(input("    Уявімо, що ви із подругами зайшли в магазин вечірніх суконь. \n" 
      "Кожна сукня унікальна і не повторюється. \n"
      "Кожна із вас може вибрати по одній сукні. \n"
      "Скільки варіантів розвитку подій? \n"
      "Введіть кількість жінок (включно з вами): "))

num_of_dresses = int(input("Введіть кількість суконь в магазині (суконь має бути не менше ніж жінок): "))

print(math.factorial(num_of_dresses) // math.factorial(num_of_dresses - num_of_friends))
